{"pageProps":{"fileName":"About","file":"---\nbanner: /GAPC-2023/covers/contest.png\n---\n\n## About\n\nThe Groningen Algorithmic Programming Contest (GAPC) is a 4 hour competitive programming contest, where students from (but not limited to) University of Groningen form teams of 1 to 3 people. The target is to solve the most problems and win the champion's cup.\n\nThe event will take place on the Saturday 29th of April in the Bernoulliborg, at the Study Landscape from 11:00 - 20:00. This is a full-day event, where not only the lunch and dinner will be provided, but also you'll have the chance to interact with our partner companies and feel the ICPC-style event vibe. More details about the schedule can be found <a href=\"https://fully-connected-graph.github.io/GAPC-2023/schedule/\">\nhere.\n</a>\n\n## Contest\n\nThis contest is open to everyone. Before registering, please read the rules of the contest and these can be found <a href=\"https://fully-connected-graph.github.io/GAPC-2023/rules/\">\nhere. </a> To participate, each team will need to bring their own laptop. \n\nTo solve the problems, you will be able to use Java, Python, C, C++ and Haskell. In the end, only the captain of the team needs to make the registration and it can be done <a href=\"https://fully-connected-graph.github.io/GAPC-2023/registration/\">\nhere. </a>\n\n## Remember how it was last year?\n\nCheck out last year's\n<a href=\"https://www.svcover.nl/photos/1522\">\nphoto album\n</a>\nto see how it was last year!\n\n<a href=\"https://www.svcover.nl/photos/1522\"  style=\"overflow: hidden;\">\n    <video src=\"./gapc-2022-slideshow.mp4\" autoplay muted loop>\n    </video>\n</a>\n\n<div>\n    <center>\n        <h1>\n            <span style=\"font-size:.75em;\">\n                Event organised by\n            </span>\n            <br/>\n            Fully Connected Graph\n        </h1>\n    </center>\n\n<div class=\"flex flex-col md:flex-row \">\n<div>\nFully Connected Graph (a.k.a. FCG) is a committee whose aim is to create an environment for students to challenge and improve their technical abilities.\n<br/><br/>\nIn the present, our main focus is on events about competitive programming and machine learning, but we expect to extend our range of events in the next academic year.\n</div>\n<div>\n    <img src=\"/GAPC-2023/fcg-members.png\">\n</div>\n</div>\n\n</div>\n\n## Contact \n\nIf you have any questions, please send us an email at programming_committee@svcover.nl\n\nOr join our [FCG Discord](https://discord.com/invite/JfzxyBHPsH). Or join the [FCG announcements WhatsApp group](https://chat.whatsapp.com/JynZLRD7yUr9f5OsQ1rzkb) to be up to date about our events."},"__N_SSG":true}